/* `welcomeLabel` UILabel text default value */
"Welcome" = "Üdvözöljük";

/* `thankyouLabel` UILabel text default value */
"ThankyouMessage" = "Köszönjük a letöltést";

/* `instructionTextView` UITextView text default value with \".notConfigurated\" state */
"WelcomeInstruction" = "Kérjük, kövesse az üdvözlőlevélben kapott utasításokat az aktiválási folyamattal kapcsolatban.";

/* `instructionTextView` UITextView text default value with \".isConfigured\" state */
"ConfiguredInstruction" = "Maradjon a csúcson a napi feladatok kezelését illetően, és dolgozzon könnyen közösen a többiekkel a projekteken.";

"ScanInstruction" = "Kérjük, indítsa el a biztonságos QR-kódot az aktiválási folyamat elindításához.";

"DiscoveryServiceInstruction" = "Kérjük, adja meg az e-mail-címét az aktiválási folyamat elindításához.";

/* checking the account(email address) user entered in discovery service */
"CheckingAccountKey" = "A fiók ellenőrzése...";

/* `signInButton` UIButton's titleLabel?.text default value */
"SignIn" = "Indítás";

"Scan" = "Szkennelés";

/* `demoLabel` UILabel text default value */
"Explore" = "Szeretné felfedezni?";

/* `demoButton` UIButton's titleLabel?.text default value */
"TryDemo" = "Demó kipróbálása";

/* The title for the passcode setup screens. */
"SetPasscodeKey" = "Jelkód beállítása";

/* The title for the enter passcode screen. */
"PasscodeKey" = "Jelkód";

/* The title for the Choose Passcode screen. */
"ChoosePasscodeTitleKey" = "Jelkód választása";

/* The title for the Confirm Passcode screen. */
"ConfirmPasscodeTitleKey" = "Jelkód megerősítése";

/* The message on the confirm passcode screen for passcode setup. */
"EnterPasscodeAgainKey" = "Adja meg a jelkódot újra.";

/* The message on the confirm passcode screen for passcode change. */
"ConfirmPasscodeKey" = "Erősítse meg a jelkódot.";

/* The message on the input passcode screen. */
"EnterYourPasscodeKey" = "Adja meg a jelkódot.";

/* The title for the passcode change screens. */
"ChangePasscodeKey" = "Jelkód módosítása";

/* The message on the input passcode screen in change passcode. */
"EnterYourCurrentPasscodeKey" = "Adja meg a mostani jelkódot.";

/* The button title string used both in passcode and\n touch ID screens to indicate not to setup now. */
"NotNowKey" = "Most nem";

/* The button title string used on the second passcode setup\n to go back to the first screen. */
"BackKey" = "Vissza";

/* The button title string used on the first passcode setup\n to go to the next screen. */
"NextKey" = "Tovább";

/* The button title string used on the passcode input screen (not in the change passcode sequence)\n When the passcode input screen is in the change passcode sequence, the button title should be changed \"Next\" */
"DoneKey" = "Kész";

/* The main message format on the setup passscode screen.\n The %d will display the number of characters required from\n the passcode policy. */
"PasscodeChooseMinCharKey" = "Válasszon ki egy legalább %d karakteres kódot az alkalmazás zárolásának megszüntetéséhez.";

/* The main message format on the setup passscode screen when the\n isDititsOnly property of the passcode policy is true.\n The %d will display the number of digits required from\n the passcode policy. */
"PasscodeChooseMinDigitKey" = "Válasszon ki egy legalább %d számjegyből álló kódot az alkalmazás zárolásának megszüntetéséhez.";

/* The message for passcode to include the required character groups\n when passcode policy requires it. */
"PasscodeRequiredGroupKey" = "A jelkódban legyen:";

/* The group name for lower case letters. */
"LowerCaseKey" = "kisbetű (a-z)";

/* The group name for upper case letters. */
"UpperCaseKey" = "nagybetű (A-Z)";

/* The group name for digits. */
"DigitsKey" = "szám (0-9)";

/* The group name for non-alphabetic characters. */
"Non-alphaKey" = "speciális karakter (!@#...)";

/* The button title for resetting passcode. */
"ResetPasscodeKey" = "Jelkód visszaállítása";

/* Alert message when validate method of FUIPasscodeValidationDelegate\n returning false for the passcode user entered in setup passcode. */
"PasscodeValidationFailedKey" = "A jelkód érvényesítése sikertelen";

/* Alert message when the passcode user entered was rejected by\n the FUIPasscodeControllerDelegate's shouldTryPasscode function. */
"PasscodeRejectedKey" = "A jelkódot visszautasította a FUIPasscodeControllerDelegate.";

/* The alert button title used on passcode validation failed, or passcode rejected. */
"RetryKey" = "Újra";

/* The title for setup touch ID screen. */
"TouchIDKey" = "Touch ID";

/* The title for setup touch ID screen. */
"FaceIDKey" = "Face ID";

/* This is to be used combined with \"Touch ID\" or \"Face ID\", e.g., \"Touch ID is now available!\" */
"IsNowAvailableKey" = " elérhető mostantól!";

/* The first paragraph of the message on the Touch ID screen when no Touch ID is enrolled on device. */
"TouchIDMessage1Key" = "A Touch ID aktiválása lehetővé teszi, hogy gyorsabban férjen hozzá az adataihoz.";

/* The second paragraph of the message on the Touch ID screen when no Touch ID is enrolled on device. */
"TouchIDMessage2Key" = "A funkció bármikor be- és kikapcsolható a Beállításokban.";

/* The first paragraph of the message on the Touch ID screen when Touch ID is enrolled on device. */
"TouchIDEnableMessage1Key" = "Kérjük, aktiválja a Touch ID-t a gyors és biztonságos hozzáférés kedvéért.";

/* The second paragraph of the message on the Touch ID screen when Touch ID is enrolled on device. */
"TouchIDEnableMessage2Key" = "Ha deaktiválva van a Touch ID, akkor a készülék jelkódot fog kérni.";

/* The first paragraph of the message on the Face ID screen when no Touch ID is enrolled on device. */
"FaceIDMessage1Key" = "A Face ID aktiválása lehetővé teszi, hogy gyorsabban férjen hozzá az adataihoz.";

/* The second paragraph of the message on the Face ID screen when no Touch ID is enrolled on device. */
"FaceIDMessage2Key" = "A funkció bármikor be- és kikapcsolható a Beállításokban.";

/* The first paragraph of the message on the Face ID screen when Touch ID is enrolled on device. */
"FaceIDEnableMessage1Key" = "Kérjük, aktiválja a Face ID-t a gyors és biztonságos hozzáférés kedvéért.";

/* The second paragraph of the message on the Face ID screen when Touch ID is enrolled on device. */
"FaceIDEnableMessage2Key" = "Ha deaktiválva van a Face ID, akkor a készülék jelkódot fog kérni.";

/* The alert title to ask user add fingerprints to use Touch ID. */
"UseTouchIDTitleKey" = "A Touch ID használatához, kérjük, adjon hozzá ujjlenyomatokat a készülékbeállításokban.";

/* The alert message to ask user add fingerprints to use Touch ID. */
"UseTouchIDMessageKey" = "Ezt egyébként bármikor elvégezheti a Beállítások - Touch ID és jelkód alatt.";

/* The alert title to ask user add fingerprints to use Face ID. */
"UseFaceIDTitleKey" = "A Face ID használatához, kérjük, regisztrálja a Face ID-t a készülékbeállításokban.";

/* The alert message to ask user add fingerprints to use Face ID. */
"UseFaceIDMessageKey" = "Ezt egyébként bármikor elvégezheti a Beállítások - Face ID és jelkód alatt.";

/* The message for the link on the Touch ID screen. */
"LearnMoreKey" = "További tudnivalók a Touch ID-ról";

/* The message for the link on the Face ID screen. */
"LearnMoreFaceIDKey" = "További tudnivalók a Face ID-ról";

/* The button title to enable Touch ID authentication. */
"EnableKey" = "Aktiválás";

/* The message displayed when authticate with Touch ID. */
"AuthWithTouchIDKey" = "Hitelesítés Touch ID-val";

/* The message displayed when authticate with Face ID. */
"AuthWithFaceIDKey" = "Hitelesítés Face ID-val";

/* The title on the navigation bar. */
"TouchIDErrorNavigationTitleKey" = "Hiba";

/* The error title. */
"AuthenticationErrorKey" = "Hitelesítési hiba";

/* The error message for Touch ID devices. */
"AuthenticationTouchIDMessageKey" = "Kérjük, végezze el a hitelesítést a Touch ID-val az alkalmazás használatához.";

/* The error message for Face ID devices. */
"AuthenticationFaceIDMessageKey" = "Kérjük, végezze el a hitelesítést a Face ID-val az alkalmazás használatához.";

/* The authenticate button text. */
"AuthenticateKey" = "Hitelesítés";

/* The message when the passcode entered in confirm passcode screen\n does not match with the one entered in the setup passcode screen. */
"PasscodeNotMatchKey" = "Nem egyeznek a jelkódok. Próbálja újra.";

/* The message format to be displayed when user entered wrong passcode\n and the remaining number of retries is greater than 1. */
"AttemptsLeftKey" = "Még %d kísérlete maradt.";

/* The message format to be displayed when user entered wrong passcode\n and there is only one remaining retry. */
"OneAttemptLeftKey" = "Még egy kísérlete maradt.";

/* The first paragraph of the alert message when the number user entered\n wrong passcode reached maximum allowed. */
"MaxAttemptsReachedKey" = "Nem maradt több kísérleti lehetőség.";

/* The second paragraph of the alert message when the number user entered\n wrong passcode reached maximum allowed. */
"EnterCredentialsKey" = "Kérjük, jelentkezzen be a jelkód visszaállításához";

/* The text of the dismiss button on the alert. */
"OKKey" = "OK";

/* The message on the passcode screen when user entered wrong passcode\n and there is no limit on the number of retries. */
"RetryPasscodeKey" = "Helytelen jelkód. Próbálja újra.";

/* The scan page title string. */
"ScanKey" = "Szkennelés";

/* The title of the pop-up message when user selected a QR code photo\n which did not have a valid QR code. */
"ScanUnsuccessfulKey" = "A szkennelés sikertelen";

/* The second line of the pop-up message when user selected a QR code photo\n which did not have a valid QR code. */
"SelectAnotherImageKey" = "Kérjük, válasszon ki QR-kód képet.";

/* The title of the pop-up message when user successfully got a QR code for\n onboarding activation but this QR code was not recognized by system. */
"InvalidQRCodeKey" = "Érvénytelen QR-kód";

/* The second line of the pop-up message when user successfully got a QR code for\n onboarding activation but this QR code was not recognized by system. */
"QRCodeNotRecognizedKey" = "Nem sikerült felismerni a QR-kódot.";

/* The title of the alert to request photo access. */
"AllowPhotoAccessKey" = "A fényképekhez való hozzáférés engedélyezése";

/* The message of the alert to request photo access. */
"GiveAccessToPhotoSettingsKey" = "Hogy ki lehessen választani a QR-kód képét, kérjük, adjon hozzáférést a fényképekhez a készülék adatvédelmi beállításaiban.";

/* The title of the alert to request camera access. */
"AllowCameraAccessKey" = "A kamerához való hozzáférés engedélyezése";

/* The message of the alert to request camera access. */
"GiveAccessToCameraSettingsKey" = "A kamerával való szkenneléshez, kérjük, adjon hozzáférést a kamerához a készülék adatvédelmi beállításaiban.";

/* *\n The alert action title to go to Settings app. */
"SettingsKey" = "Beállítások";

/* The title string for the QR code scan confirmation screen. */
"ConfirmationKey" = "Visszaigazolás";

/* The success message for the QR code scan confirmation screen. */
"ScanSucceededKey" = "A szkennelés sikerült. Össze lesz kapcsolva a következővel:";

/* The title string for the \"Continue\" button */
"ContinueKey" = "Folytatás";

/* The title string for the back bar button on activation screen */
"BackBarButtonForActivationScreenKey" = "Indítás";

/* FUIActivation Screen - headlineLabel */
"FUIActivationScreen_headlineLabel" = "Aktiválás";

/* FUIActivation Screen - detailLabel */
"FUIActivationScreen_detailLabel" = "Ha kapott üdvözlőlevelet, akkor kattintson az e-mailban küldött aktiválási linkre. Az előkészítést elkezdheti azonban az e-mail-cím megadásával vagy a QR-kód beszkennelésével is.";

/* FUIActivation Screen - primaryActionButton Title */
"FUIActivationScreen_primaryActionButtonTitle" = "Tovább";

/* FUIActivation Screen - subheadlineLabel */
"FUIActivationScreen_subheadlineLabel" = "Vagy";

/* FUIActivation Screen - primaryActionButton Title */
"FUIActivationScreen_secondaryActionButtonTitle" = "Szkennelés";

/* FUIEULAView Screen - agree button */
"AgreeKey" = "Elfogadom";

/* FUIEULAView Screen - disagree button */
"DisagreeKey" = "Elutasítom";

/* The authentication title. */
"AuthenticationKey" = "Hitelesítés";

/* The basic authentication message. */
"basicAuthenticationMessageKey" = "Adja meg a felhasználónevét és a jelszavát a hitelesítéshez.";

/* Username input field placeholder string */
"usernameKey" = "Felhasználónév";

/* Password input field placeholder string */
"passwordKey" = "Jelszó";

/* Sign In button string. */
"SignInKey" = "Bejelentkezés";

/* Error message when failed to sign in. */
"SignInErrorKey" = "Helytelen bejelentkezési adatok. Próbálja újra.";

/* The dynamic authentication message. */
"DynamicAuthenticationMessageKey" = "Kérjük, adja meg a következő adatokat az aktiválási folyamat elindításához.";

/* The message displayed on the banner when verifying information user entered. */
"VerifyingMessageKey" = "Adatok ellenőrzése";

/* Cancel button string. */
"CancelKey" = "Mégse";

/* Allow button string. */
"AllowKey" = "Engedélyezés";

/* Deny button string. */
"DenyKey" = "Elutasítás";

/* No button string. */
"NoKey" = "Nem";

/* Quit button string. */
"QuitKey" = "Kilépés";

/* GiveConsent button string. */
"GiveConsentKey" = "Hozzájárulás megadása";

/* Navbar title string. */
"StepKey" = "Lépés";

/* Navbar title string. */
"OfKey" = "/";

/* CancelConfirmation message string. */
"CancelConfirmationKey" = "Valóban szeretne kilépni az előkészítési folyamatból?";

/* MandatoryMessage button string. */
"MandatoryMessageKey" = "Hozzájárulás nélkül nem tudja folytatni az előkészítést.";

/* Switch User button string. */
"SwitchOrAddUserKey" = "Felhasználó váltása vagy hozzáadása";

/* Title for Log In button */
"LogInKey" = "Bejelentkezés";

/* Placeholder text in search bar for searching users in multi-user login controller */
"SearchUsersKey" = "Felhasználók keresése ezen az eszközön";

/* The button title for forgot passcode. */
"ForgotPasscodeKey" = "Elfelejtette a jelkódját?";

/* Title for Loction */
"PNLoctionTitleKey" = "Kapcsolja be a helymeghatározást a térkép és a navigációs funkciók használatához";

/* Title for Notifications */
"PNNotificationsTitleKey" = "Kapcsolja be az értesítéseket, hogy időben tájékozódhasson a fontos közleményekről";

/* Title for Photos */
"PNPhotosTitleKey" = "Kapcsolja be a fotógalériához való hozzáférést a fotók megosztásának és a fotógaléria elérésének engedélyezéséhez";

/* Title for Calendar */
"PNCalendarTitleKey" = "Kapcsolja be a naptárhozzáférést szobák foglalásához és a találkozók megtekintéséhez";

/* Title for Camera */
"PNCameraTitleKey" = "Kapcsolja be a kamerát a Face ID-val való bejelentkezéshez és hitelesítéshez";

/* Subtitle for FUIPrivacyNoticeView */
"PNSubtitleKey" = "Később ezt az engedélyt módosíthatja az alkalmazásbeállításokban";

/* FooterText for FUIPrivacyNoticeSettingsController */
"PNSettingsFooterTextKey" = "Az alkalmazás az alábbi engedélyeket használja, hogy az Ön számára a lehető legjobb élményt nyújthassa";

/* FooterText of Location for FUIPrivacyNoticeOpenSettingsController */
"PNOpenSettingsLocationFooterTextKey" = "Engedélyezze, hogy az alkalmazás hozzáférjen a Helymeghatározáshoz, és értesítse Önt, amikor használja azt.\n\nA Helymeghatározás engedélyezésének beállításához vagy szerkesztéséhez nyissa meg az iOS beállításokat > Koppintson a „Hely” opcióra > Koppintson az „Alkalmazás” opcióra > Válassza ki az Ön által preferált Hely engedélyezési beállítást";

/* FooterText of Notifications for FUIPrivacyNoticeOpenSettingsController */
"PNOpenSettingsNotificationsFooterTextKey" = "Engedélyezze, hogy az alkalmazás hozzáférjen az Értesítésekhez, és értesítse Önt, amikor használja azt.\n\nAz Értesítések engedélyezésének beállításához vagy szerkesztéséhez nyissa meg az iOS beállításokat > Koppintson az „Értesítések” opcióra > Koppintson az „Alkalmazás” opcióra > Válassza ki az Ön által preferált Értesítés engedélyezési beállítást";

/* FooterText of Photos for FUIPrivacyNoticeOpenSettingsController */
"PNOpenSettingsPhotosFooterTextKey" = "Engedélyezze, hogy az alkalmazás hozzáférjen a Fotókhoz, és értesítse Önt, amikor használja azt.\n\nA Fotók engedélyezésének beállításához vagy szerkesztéséhez nyissa meg az iOS beállításokat > Koppintson a „Fotók” opcióra > Koppintson az „Alkalmazás” opcióra > Válassza ki az Ön által preferált Fotók engedélyezési beállítást";

/* FooterText of Camera for FUIPrivacyNoticeOpenSettingsController */
"PNOpenSettingsCameraFooterTextKey" = "Engedélyezze, hogy az alkalmazás hozzáférjen a Kamerához, és értesítse Önt, amikor használja azt.\n\nA Kamera engedélyezésének beállításához vagy szerkesztéséhez nyissa meg az iOS beállításokat > Koppintson a „Kamera” opcióra > Koppintson az „Alkalmazás” opcióra > Válassza ki az Ön által preferált Kamera engedélyezési beállítást";

/* FooterText of Calendar for FUIPrivacyNoticeOpenSettingsController */
"PNOpenSettingsCalendarFooterTextKey" = "Engedélyezze, hogy az alkalmazás hozzáférjen a Naptárhoz, és értesítse Önt, amikor használja azt.\n\nA Naptár engedélyezésének beállításához vagy szerkesztéséhez nyissa meg az iOS beállításokat > Koppintson a „Naptár” opcióra > Koppintson az „Alkalmazás” opcióra > Válassza ki az Ön által preferált Naptár engedélyezési beállítást";

/* The button title for FUIPrivacyNoticeOpenSettingsController */
"PNOpenSettingKey" = "iOS beállítások megnyitása";

